# Напишите код для преобразования произвольного списка вида ['2018-01-01', 'yandex', 'cpc', 100] любой длины в словарь
# {'2018-01-01':{'yandex':{'cpc':100}}}
l1 = ['2018-01-01', 'yandex', 'cpc', 100]

d = l1[-1]
for n in l1[-2::-1]:
  d = { n: d }
print(d)
